app/Controllers/Mahasiswa.php

    public function show()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_mahasiswa');
        $query = $builder->get();
---
SELECT *
FROM `tb_mahasiswa`